{"format": "graph-model", "generatedBy": "2.2.0", "convertedBy": "TensorFlow.js Converter v2.0.1.post1", "userDefinedMetadata": {"signature": {"inputs": {"conv2d_input:0": {"name": "conv2d_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "180"}, {"size": "180"}, {"size": "3"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}}, "modelTopology": {"node": [{"name": "conv2d_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "180"}, {"size": "180"}, {"size": "3"}]}}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential_6/batch_normalization_6/batchnorm/mul", "op": "Const", "input": ["^conv2d_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential_5/batch_normalization_5/batchnorm/mul", "op": "Const", "input": ["^conv2d_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential_4/batch_normalization_4/batchnorm/mul", "op": "Const", "input": ["^conv2d_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_2", "op": "Const", "input": ["^conv2d_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_3", "op": "Const", "input": ["^conv2d_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_4", "op": "Const", "input": ["^conv2d_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential_3/batch_normalization_3/FusedBatchNormV3/Scaled", "op": "Const", "input": ["^conv2d_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_5", "op": "Const", "input": ["^conv2d_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_6", "op": "Const", "input": ["^conv2d_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_7", "op": "Const", "input": ["^conv2d_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_8", "op": "Const", "input": ["^conv2d_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential_3/batch_normalization_3/FusedBatchNormV3/Offset", "op": "Const", "input": ["^conv2d_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_9", "op": "Const", "input": ["^conv2d_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_10", "op": "Const", "input": ["^conv2d_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_11", "op": "Const", "input": ["^conv2d_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_16", "op": "Const", "input": ["^conv2d_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_17", "op": "Const", "input": ["^conv2d_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "64"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_18", "op": "Const", "input": ["^conv2d_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential_2/batch_normalization_2/FusedBatchNormV3/Scaled", "op": "Const", "input": ["^conv2d_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_19", "op": "Const", "input": ["^conv2d_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_20", "op": "Const", "input": ["^conv2d_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "64"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_21", "op": "Const", "input": ["^conv2d_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_26", "op": "Const", "input": ["^conv2d_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_27", "op": "Const", "input": ["^conv2d_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential_2/batch_normalization_2/FusedBatchNormV3/Offset", "op": "Const", "input": ["^conv2d_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_28", "op": "Const", "input": ["^conv2d_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_29", "op": "Const", "input": ["^conv2d_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_30", "op": "Const", "input": ["^conv2d_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_31", "op": "Const", "input": ["^conv2d_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_36", "op": "Const", "input": ["^conv2d_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_37", "op": "Const", "input": ["^conv2d_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential_1/batch_normalization_1/FusedBatchNormV3/Scaled", "op": "Const", "input": ["^conv2d_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_38", "op": "Const", "input": ["^conv2d_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_39", "op": "Const", "input": ["^conv2d_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "1"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_40", "op": "Const", "input": ["^conv2d_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_41", "op": "Const", "input": ["^conv2d_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential_1/batch_normalization_1/FusedBatchNormV3/Offset", "op": "Const", "input": ["^conv2d_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/flatten/Const", "op": "Const", "input": ["^conv2d_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_46", "op": "Const", "input": ["^conv2d_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6400"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_47", "op": "Const", "input": ["^conv2d_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential_4/batch_normalization_4/batchnorm/sub", "op": "Const", "input": ["^conv2d_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_52", "op": "Const", "input": ["^conv2d_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_53", "op": "Const", "input": ["^conv2d_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential/batch_normalization/FusedBatchNormV3/Scaled", "op": "Const", "input": ["^conv2d_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential_5/batch_normalization_5/batchnorm/sub", "op": "Const", "input": ["^conv2d_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_58", "op": "Const", "input": ["^conv2d_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_59", "op": "Const", "input": ["^conv2d_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential_6/batch_normalization_6/batchnorm/sub", "op": "Const", "input": ["^conv2d_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_64", "op": "Const", "input": ["^conv2d_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential/batch_normalization/FusedBatchNormV3/Offset", "op": "Const", "input": ["^conv2d_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_65", "op": "Const", "input": ["^conv2d_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/conv2d/Relu", "op": "_FusedConv2D", "input": ["conv2d_input", "Func/StatefulPartitionedCall/input/_2", "Func/StatefulPartitionedCall/input/_3"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/sequential_7/conv2d_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_7/conv2d/Relu", "Func/StatefulPartitionedCall/input/_4", "Func/StatefulPartitionedCall/input/_5"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/sequential_7/max_pooling2d/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_7/conv2d_1/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential/separable_conv2d/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/sequential_7/max_pooling2d/MaxPool", "Func/StatefulPartitionedCall/input/_6"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential/separable_conv2d/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_7/sequential/separable_conv2d/separable_conv2d/depthwise", "Func/StatefulPartitionedCall/input/_7", "Func/StatefulPartitionedCall/input/_8"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential/separable_conv2d_1/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/sequential_7/sequential/separable_conv2d/Relu", "Func/StatefulPartitionedCall/input/_9"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential/separable_conv2d_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_7/sequential/separable_conv2d_1/separable_conv2d/depthwise", "Func/StatefulPartitionedCall/input/_10", "Func/StatefulPartitionedCall/input/_11"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential/batch_normalization/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_7/sequential/batch_normalization/FusedBatchNormV3/Scaled", "StatefulPartitionedCall/sequential_7/sequential/separable_conv2d_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential/batch_normalization/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/sequential_7/sequential/batch_normalization/FusedBatchNormV3/Mul", "StatefulPartitionedCall/sequential_7/sequential/batch_normalization/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential/max_pooling2d_1/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_7/sequential/batch_normalization/FusedBatchNormV3"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential_1/separable_conv2d_2/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/sequential_7/sequential/max_pooling2d_1/MaxPool", "Func/StatefulPartitionedCall/input/_16"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential_1/separable_conv2d_2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_7/sequential_1/separable_conv2d_2/separable_conv2d/depthwise", "Func/StatefulPartitionedCall/input/_17", "Func/StatefulPartitionedCall/input/_18"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential_1/separable_conv2d_3/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/sequential_7/sequential_1/separable_conv2d_2/Relu", "Func/StatefulPartitionedCall/input/_19"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential_1/separable_conv2d_3/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_7/sequential_1/separable_conv2d_3/separable_conv2d/depthwise", "Func/StatefulPartitionedCall/input/_20", "Func/StatefulPartitionedCall/input/_21"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential_1/batch_normalization_1/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_7/sequential_1/batch_normalization_1/FusedBatchNormV3/Scaled", "StatefulPartitionedCall/sequential_7/sequential_1/separable_conv2d_3/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential_1/batch_normalization_1/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/sequential_7/sequential_1/batch_normalization_1/FusedBatchNormV3/Mul", "StatefulPartitionedCall/sequential_7/sequential_1/batch_normalization_1/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential_1/max_pooling2d_2/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_7/sequential_1/batch_normalization_1/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential_2/separable_conv2d_4/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/sequential_7/sequential_1/max_pooling2d_2/MaxPool", "Func/StatefulPartitionedCall/input/_26"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential_2/separable_conv2d_4/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_7/sequential_2/separable_conv2d_4/separable_conv2d/depthwise", "Func/StatefulPartitionedCall/input/_27", "Func/StatefulPartitionedCall/input/_28"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential_2/separable_conv2d_5/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/sequential_7/sequential_2/separable_conv2d_4/Relu", "Func/StatefulPartitionedCall/input/_29"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential_2/separable_conv2d_5/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_7/sequential_2/separable_conv2d_5/separable_conv2d/depthwise", "Func/StatefulPartitionedCall/input/_30", "Func/StatefulPartitionedCall/input/_31"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential_2/batch_normalization_2/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_7/sequential_2/batch_normalization_2/FusedBatchNormV3/Scaled", "StatefulPartitionedCall/sequential_7/sequential_2/separable_conv2d_5/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential_2/batch_normalization_2/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/sequential_7/sequential_2/batch_normalization_2/FusedBatchNormV3/Mul", "StatefulPartitionedCall/sequential_7/sequential_2/batch_normalization_2/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential_2/max_pooling2d_3/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_7/sequential_2/batch_normalization_2/FusedBatchNormV3"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential_3/separable_conv2d_6/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/sequential_7/sequential_2/max_pooling2d_3/MaxPool", "Func/StatefulPartitionedCall/input/_36"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential_3/separable_conv2d_6/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_7/sequential_3/separable_conv2d_6/separable_conv2d/depthwise", "Func/StatefulPartitionedCall/input/_37", "Func/StatefulPartitionedCall/input/_38"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential_3/separable_conv2d_7/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/sequential_7/sequential_3/separable_conv2d_6/Relu", "Func/StatefulPartitionedCall/input/_39"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential_3/separable_conv2d_7/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_7/sequential_3/separable_conv2d_7/separable_conv2d/depthwise", "Func/StatefulPartitionedCall/input/_40", "Func/StatefulPartitionedCall/input/_41"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential_3/batch_normalization_3/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_7/sequential_3/batch_normalization_3/FusedBatchNormV3/Scaled", "StatefulPartitionedCall/sequential_7/sequential_3/separable_conv2d_7/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential_3/batch_normalization_3/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/sequential_7/sequential_3/batch_normalization_3/FusedBatchNormV3/Mul", "StatefulPartitionedCall/sequential_7/sequential_3/batch_normalization_3/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential_3/max_pooling2d_4/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_7/sequential_3/batch_normalization_3/FusedBatchNormV3"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/sequential_7/flatten/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_7/sequential_3/max_pooling2d_4/MaxPool", "StatefulPartitionedCall/sequential_7/flatten/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential_4/dense/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_7/flatten/Reshape", "Func/StatefulPartitionedCall/input/_46", "Func/StatefulPartitionedCall/input/_47"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential_4/batch_normalization_4/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_7/sequential_4/batch_normalization_4/batchnorm/mul", "StatefulPartitionedCall/sequential_7/sequential_4/dense/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential_4/batch_normalization_4/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_7/sequential_4/batch_normalization_4/batchnorm/mul_1", "StatefulPartitionedCall/sequential_7/sequential_4/batch_normalization_4/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential_5/dense_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_7/sequential_4/batch_normalization_4/batchnorm/add_1", "Func/StatefulPartitionedCall/input/_52", "Func/StatefulPartitionedCall/input/_53"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential_5/batch_normalization_5/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_7/sequential_5/batch_normalization_5/batchnorm/mul", "StatefulPartitionedCall/sequential_7/sequential_5/dense_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential_5/batch_normalization_5/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_7/sequential_5/batch_normalization_5/batchnorm/mul_1", "StatefulPartitionedCall/sequential_7/sequential_5/batch_normalization_5/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential_6/dense_2/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_7/sequential_5/batch_normalization_5/batchnorm/add_1", "Func/StatefulPartitionedCall/input/_58", "Func/StatefulPartitionedCall/input/_59"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential_6/batch_normalization_6/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_7/sequential_6/batch_normalization_6/batchnorm/mul", "StatefulPartitionedCall/sequential_7/sequential_6/dense_2/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/sequential_6/batch_normalization_6/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_7/sequential_6/batch_normalization_6/batchnorm/mul_1", "StatefulPartitionedCall/sequential_7/sequential_6/batch_normalization_6/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_3/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_7/sequential_6/batch_normalization_6/batchnorm/add_1", "Func/StatefulPartitionedCall/input/_64", "Func/StatefulPartitionedCall/input/_65"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_3/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_7/dense_3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_7/dense_3/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 175}}, "weightsManifest": [{"paths": ["group1-shard1of4.bin", "group1-shard2of4.bin", "group1-shard3of4.bin", "group1-shard4of4.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_7/sequential_6/batch_normalization_6/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/sequential_5/batch_normalization_5/batchnorm/mul", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/sequential_4/batch_normalization_4/batchnorm/mul", "shape": [512], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_2", "shape": [3, 3, 3, 16], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_3", "shape": [16], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_4", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/sequential_3/batch_normalization_3/FusedBatchNormV3/Scaled", "shape": [256], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_5", "shape": [16], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_6", "shape": [3, 3, 16, 1], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_7", "shape": [1, 1, 16, 32], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_8", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/sequential_3/batch_normalization_3/FusedBatchNormV3/Offset", "shape": [256], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_9", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_10", "shape": [1, 1, 32, 32], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_11", "shape": [32], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_16", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_17", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_18", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/sequential_2/batch_normalization_2/FusedBatchNormV3/Scaled", "shape": [128], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_19", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_20", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_21", "shape": [64], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_26", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_27", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/sequential_2/batch_normalization_2/FusedBatchNormV3/Offset", "shape": [128], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_28", "shape": [128], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_29", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_30", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_31", "shape": [128], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_36", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_37", "shape": [1, 1, 128, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/sequential_1/batch_normalization_1/FusedBatchNormV3/Scaled", "shape": [64], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_38", "shape": [256], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_39", "shape": [3, 3, 256, 1], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_40", "shape": [1, 1, 256, 256], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_41", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/sequential_1/batch_normalization_1/FusedBatchNormV3/Offset", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/flatten/Const", "shape": [2], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/input/_46", "shape": [6400, 512], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_47", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/sequential_4/batch_normalization_4/batchnorm/sub", "shape": [512], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_52", "shape": [512, 128], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_53", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/sequential/batch_normalization/FusedBatchNormV3/Scaled", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/sequential_5/batch_normalization_5/batchnorm/sub", "shape": [128], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_58", "shape": [128, 64], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_59", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/sequential_6/batch_normalization_6/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_64", "shape": [64, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/sequential/batch_normalization/FusedBatchNormV3/Offset", "shape": [32], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_65", "shape": [1], "dtype": "float32"}]}]}